Revit 2027 API
RebarShapeDefinition Methods
The RebarShapeDefinition type exposes the following members.
Methods
Name | Description
AddFormulaParameter |  Add a formula-driven parameter to the shape definition.
AddParameter |  Add a parameter to the shape definition.
CheckDefaultParameterValues |  Check that the shape can be solved with the default parameter values.
Dispose
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetParameterDefaultValue |  Return the parameter's default value as stored in the definition.
GetParameterFormula |  Return the parameter's formula, if one is associated with it.
GetParameters |  Return the Ids of the shared parameters in the Definition.
GetType | Gets the Type of the current instance.
(Inherited from Object)
HasParameter |  Whether the definition stores the parameter.
RemoveParameter |  Remove the parameter from the definition.
SetParameterDefaultValue |  Change the parameter's value as stored in the definition.
SetParameterFormula |  Associate a formula with the parameter.
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
See Also
Reference
RebarShapeDefinition Class
Autodesk.Revit.DB.Structure Namespace